{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
    "creationSource": null,
    "description": "This set Outlook as default app",
    "name": "Dustin - Default Applications",
    "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms": "windows10",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies": "mdm",
    "templateReference": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
        "templateId": "",
        "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "assignments": [

    ],
    "settings": [{
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "id": "0",
        "settingInstance": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
            "settingDefinitionId": "device_vendor_msft_policy_config_applicationdefaults_defaultassociationsconfiguration",
            "settingInstanceTemplateReference": null,
            "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPERlZmF1bHRBc3NvY2lhdGlvbnM+CiAgPEFzc29jaWF0aW9uIElkZW50aWZpZXI9Im1haWx0byIgUHJvZ0lkPSJPdXRsb29rLlVSTC5tYWlsdG8uMTUiIEFwcGxpY2F0aW9uTmFtZT0iT3V0bG9vayIgLz4KPC9EZWZhdWx0QXNzb2NpYXRpb25zPg=="
            }
        }
    }],
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027948c03d8-4b99-47fe-97eb-01c9ee3f166d\u0027)/microsoft.graph.assign"
    },
    "#microsoft.graph.createCopy": {
        "title": "microsoft.graph.createCopy",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027948c03d8-4b99-47fe-97eb-01c9ee3f166d\u0027)/microsoft.graph.createCopy"
    }
}